# Практическая работа №1 
Знакомство с IntelliJ IDEA. Разбор синтаксиса языка программирования
Java, типы данных и арифметические выражения, структуры выбора и
циклы. Знакомство с ООП. 



## Числовые типы данных и операции

### Задача 1
Напишите программу, которая конвертирует сумму денег из китайских юаней в российские рубли по курсу покупки 11.91.
```java
import java.util.Scanner;
import java.math.*;

public class Task1 {
    public static void main(String[] args) {
        final double ROUBLES_PER_YUAN = 11.91;

        Scanner input = new Scanner(System.in);

        System.out.println("Введите сумму юаней: ");
        int yuan = input.nextInt();
        double roubles = ROUBLES_PER_YUAN * yuan;

        System.out.println(Math.ceil(roubles));
    }
}
```

### Задача 2
Перепишите программу, которая конвертирует сумму денег из китайских
юаней в российские рубли по курсу покупки 11.91, добавив структуру
выбора для принятия решений об окончаниях входной валюты в зависимости
от ее значения.
```java
import java.util.Scanner;
import java.math.*;

public class Task2 {
    public static void main(String[] args) {
        final double ROUBLES_PER_YUAN = 11.91;

        Scanner input = new Scanner(System.in);

        System.out.println("Введите сумму юаней: ");
        int yuan = input.nextInt();
        double roubles = ROUBLES_PER_YUAN * yuan;

        String word = switch (yuan % 10) {
            case 1 -> " китайский юань";
            case 2, 3, 4 -> " китайских юаня";
            default -> " китайских юаней";
        };
        if ((yuan / 10) % 10 == 1) {word = " китайских юаней";} // для чисел-исключений с 11 по 19

        System.out.println(yuan + word + " в рублях: " + Math.ceil(roubles));
    }
}
```


## Объекты и классы: cоздание классов и методов классов

### Задача 1
Напишите программу, в которой создается класс Car. В данном классе должны быть обозначены следующие поля: String model, String license, String color, int year – модель автомобиля, номер автомобиля, цвет автомобиля и год выпуска соответственно. Класс должен содержать три конструктора, один конструктор, который включает в себя все поля класса, один конструктор по умолчанию, один включает поля по выбору студента.
```java
public class Car {
    String model;
    String license;
    String color;
    int year;

    public Car() {
        model = "Lada Priora";
        license = "А777АА123";
        color = "red";
        year = 2003;
    }

    public Car(
            String model,
            String license,
            String color,
            int year
    ) {
        this.model = model;
        this.license = license;
        this.color = color;
        this.year = year;
    }

    public Car(String model, String color) {
        this.model = model;
        license = "А777АА123";
        this.color = color;
        year = 2030;
    }
}
```

### Задача 2
В отдельном классе Main создайте экземпляры классов (объекты), используя различные конструкторы, реализованные в задаче #1. Создайте в классе метод To_String(), который будет выводить значения полей экземпляров класса. Проверьте работу созданного метода, вызвав его у объекта. Дополните класс методами для получения и установки значений для всех полей (геттерами и сеттерами). Создайте метод класса, который будет возвращать возраст автомобиля, вычисляющийся от текущего года, значение текущего года допускается сделаться константным.  

*Car.java:*
```java
public class Car {
    private String model;
    private String license;
    private String color;
    private int year;

    public void setModel(String value) { model = value; }
    public String getModel() { return model; }

    public void setLicense(String value) { license = value; }
    public String getLicense() { return license; }

    public void setColor(String value) { color = value; }
    public String getColor() { return color; }

    public void setYear(int value) { year = value; }
    public int getYear() { return year; }

    public Car() {
        model = "Lada Priora";
        license = "А777АА123";
        color = "red";
        year = 2003;
    }

    public Car(
            String model,
            String license,
            String color,
            int year
    ) {
        this.model = model;
        this.license = license;
        this.color = color;
        this.year = year;
    }

    public Car(String model, String color) {
        this.model = model;
        license = "А777АА123";
        this.color = color;
        year = 2030;
    }

    public void To_String() {
        System.out.println(model);
        System.out.println(license);
        System.out.println(color);
        System.out.println(year);
    }

    public void printAge() {
        System.out.println("Возраст автомобиля: " + (2025 - year) + " лет");
    }
}
```

*Main.java:*
```java
public class Main {
    public static void main(String[] args) {
        Car car1 = new Car();
        Car car2 = new Car(
                "Subaru Forester",
                "white"
        );
        Car car3 = new Car(
                "Ferrari Superfast",
                "Р739ТН777",
                "Red",
                1988
        );

        car3.printAge();
        car2.To_String();
    }
}
```